Revert "feat(docs): convert architecture diagram to PlantUML"
This reverts commit f6b1975273c89f9a50dcb9d1807edf7559c131fd.
